# n = 10
# m = 100
#
# print('первая переменная -', n, 'Вторая переменная-', m,
#       'm/n =', m//n)
#
# print('первая переменная - "%d", Вторая переменная- "%d", m/n = "%d"' % (n, m, m//n))
# print('первая переменная - "{}", Вторая переменная- "{}", m/n = "{}"'.format(n, m, m//n))


'''
Множества (set) неупорядоченный набор уникальных объектов (любые неизменяемые типы данных)

  множество относится к хэш таблицам по структуре данных
  список относится к массиву (в разрезе структуры данных)
'''

ls = [22, 22, 22, 33, 44]
st = set(ls)
print(st)
st.clear()
st = {22, 33, 44}
print(st)

st.add(100) #""" добавить элемент (как append в строках) один объект, """
st.update({2, 3}) # добавляет несколько объектов в само множество
print(st)
n = st.pop() # удаляет элемент по индексу
st.remove(3) # удаляет если находит, если не находит, то ошибка
st.discard(3) # удаляет если находит, если не находит, то ничего не происходит
print(n)


print(st)
# print(st)
# for i in st:
#     print(i)

st1 = {3, 4, 33}
st2 = {3, 4, 44}

res = st1.union(st2) # объеденение множеств 1й способ
res = st1 | st2 # объеденение множеств 2й способ

res = st1.intersection(st2) # пересечение множеств 1й способ
res = st1 & st2 # пересечение множеств 2й способ

res = st1.difference(st2) # Вычитание множеств 1й способ
res = st2 - st1  # Вычитание множеств 2й способ

print(res)

res = st1.symmetric_difference(st2) # Симметричное вычитание
res = st1 ^ st2
print(res)

st3 = {3, 4}
print(st3.issubset(st2)) # Подмножество
print(st1.issuperset(st3)) # Супермножество


