'''
dict
Непорядоченный набор пар ключ:значение в которых ключ уникален
Тоже как и множество принадлежит структуре данных - хэш таблица
'''

d = {}

d = {'Pb': 'свинец', 'Au': 'Золото'}

print(d['Pb']) # поиск по ключу, если ключа нет - ошибка
print(d.get('Pb')) # поиск по ключу, если ключа нет - None

d['Pb'] = 'Свинец' # добавление пары ключ значение, т.к. ключ уже был, заменилось значение
print(d)

d['Fe'] = 'Железо' # добавление пары ключ значение
print(d)

d.setdefault(1, 1000) # запрещает добавление значения по уже созданным ключам, по новым добавляет
d.update({3: 33, 1: 11}) # добавляет новые ключи и значение и обновляет значение в ключах, которые уже были

n = d.pop('Fe')
nn = d.popitem() #  убирает последнюю добавленную пару ключ значение
print(nn)
print(n)
# d.clear() # Полностью очишает словарь
print(d)
print(len(d))

print(d.keys())
print(list(d.keys())) # воспринимаются только ключи

for i in d:
    print(i)

print(list(d.values()))
for v in d.values():
    print(v)

print(list(d.items()))
for k, v in d.items():
    print(k, v)

let = [('Pb', 'Свинец'), ('Au', 'Золото'), (1, 111)]
dd = dict(let) # создать словарь и массива
print(dd)
lst = [11, 22, 33]
dd = dict.fromkeys(lst, 100) # взять массив lst и сделать словарь и заполнить значениями (второй аргумент)
print(dd)

dd = {i: i**2 for i in range(10, 20)} # dict comprehension
print(dd)
dd = {}
for i in range(10, 20):
   dd[i] = i**2
print(dd)


