s = 'ЗдравстВуйте, гости!'

# print(s[0])
# print(s[6])
# print(s[-1])
#
# print(len(s))
#
# print(s[::1])
# print(s[::-1])

# for i in s:
#     print(i, end=' ')

# for i in range(len(s)):
#     print(s[i], end='  ')

print(s.index(',')) # Как найти положение символа по индексу. Использован метод index

print(s.isalpha())
print(s.isdigit())
print(s.islower())
print(s.isupper())
print(s.startswith('З'))
print(s.endswith('!'))

print(n := s.lower()) # := моржовый оператор, для присваивания на ходу
print(n)
print(s)

print(s.upper())
print(s.title())  # Все слова начинаются с большой буквы
print(s.capitalize()) # Переменная начинается с большой буквы
print(s.rjust(40)) # Переменная пишется в 40 знакоместах выравнивание по правому краю
print(s.ljust(40)) # Переменная пишется в 40 знакоместах выравнивание по левому краю
print(s.center(40)) # Переменная пишется в 40 знакоместах выравнивание по центру
print(s.strip()) # Удаляем пробелы по краям
print(s.strip('!З ')) # Удаляем символы с обеих сторон
print(s.rstrip()) # Удаляем пробелы справа
print(s.lstrip()) # Удаляем пробелы слева
print(s.index('т', 8)) #  Ищем индекс буквы т (искомое) начиная с 8й позиции (старт), можно задать конец. Поиск индекса символа или начала подстроки
print(s.find('т', 8, 11)) # Находит вхождение символа и возвращает индекс, если вхождения нет вернет индекс -1
print(s.replace('т', 'LT').replace(',', '')) # Замена одного символа в строке на другой, так же можно использовать подряд и заменить пустым значением
ls = (s.split()) # Создает список разделяя слова по пробелу
ls = (s.split(', ')) # Передаем аргумент по которому происходит разделение

print(ls)
print(', '.join(ls)) # Собирает коллекцию в строку по переданному аргументу